Revit 2024 API
FabricSheet.SetSegmentLength Method
 Sets the value of the bent fabric sheet segment(like A, B, C, D etc.)
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public void SetSegmentLength(
	ElementId segmentParameterId,
	double value
)
Visual Basic
Public Sub SetSegmentLength ( _
	segmentParameterId As ElementId, _
	value As Double _
)
Visual C++
public:
void SetSegmentLength(
	ElementId^ segmentParameterId,
	double value
)
Parameters
segmentParameterId
Type: Autodesk.Revit.DB.ElementId
 The segment ID of the bent fabric sheet.
value
Type: System.Double
 The length value to set
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The given value for value is not a number -or-
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The given value for value must be between 0 and 30000 feet.
See Also
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace